## Pandas

pandas.pydata.org

In [3]:
import pandas as pd
k=pd.Series([1,5,9,2,4])
print(k)

0    1
1    5
2    9
3    2
4    4
dtype: int64

In [5]:
m=pd.Series([45,12,23],index=['a','b','c'])
m

a    45
b    12
c    23
dtype: int64

In [7]:
m['a']

45

In [13]:
v=pd.DataFrame({"Name":["baru","vara","chinna"],"Id":["N140001","N140002","N140003"],"Grade":["B","B","A+"]})
v

     Name       Id Grade
0    baru  N140001     B
1    vara  N140002     B
2  chinna  N140003    A+

In [15]:
m=pd.DataFrame([["abc","erg","dfd"],[1,2,3],[10,20,30]])
m

     0    1    2
0  abc  erg  dfd
1    1    2    3
2   10   20   30